Tekla.Structures.Drawing.Plugin
The Plugin class represents a drawing plug-in.
The following example demonstrates how to insert a plug-in into a view.
The plug-in used in this example is the Center of gravity dimensions plug-in (COGDimensioning).
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
DrawingObjectEnumerator allViews = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
allViews.MoveNext();
ViewBase curView = allViews.Current as ViewBase;
Plugin myPlugin = new Plugin(curView, "COGDimensioning");
PluginPickerInput newPluginInput = new PluginPickerInput();
newPluginInput.Add(new PickerInputPoint(curView, new Point(100, 200)));
newPluginInput.Add(new PickerInputPoint(curView, new Point(300, 400)));
myPlugin.SetPickerInput(newPluginInput);
myPlugin.Insert(); // Inserts the plug-in, the plug-in's DefineInput method's UI.Picker calls will use the given data above.
// After the Insert returns the Plugin is inserted into the drawing view.
// Alternatively, if there are some errors during the insertion of the plug-in,
// exceptions may be thrown or the return value of Insert will be false.
}
}

Tekla.Structures.Drawing.Plugin.Name
Gets the name of the plug-in.

Tekla.Structures.Drawing.Plugin.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if the names of the objects match.

Tekla.Structures.Drawing.Plugin.#ctor
Create an instance of the object with empty content.

Tekla.Structures.Drawing.Plugin.#ctor(Tekla.Structures.Drawing.ViewBase,System.String)
Creates a new plug-in instance.
View: The view to be used.
Name: The plug-in name to be used.

Tekla.Structures.Drawing.Plugin.SetPickerInput(Tekla.Structures.Drawing.PluginPickerInput)
Defines the sequence of inputs to use in place of interactive picks when the plug-in is inserted to a drawing.
Input: The sequence of picks to provide to the plug-in at insertion.

Tekla.Structures.Drawing.Plugin.WaitInPluginQueue
Block thread while define input is running.
Returns: True if successful.

Tekla.Structures.Drawing.Plugin.Delete
Deletes the plug-in from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Plugin.Select
Selects the plug-in from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Plugin.Modify
Modifies the plug-in in the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Plugin.Insert
Inserts the plug-in into the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Plugin.GetPluginInput
Retrieves the input defined by the plug-in after insertion.
Returns: List of Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition

Tekla.Structures.Drawing.Plugin.ApplyStandardValues(System.String)
Applies the values of the specified file as the default values for the dialog belonging to this plug-in.
This will affect each Insert call of the plug-ins with the same name.
Filename: The short name of the file containing the attributes.
Returns: True on success. Otherwise, false.

Tekla.Structures.Drawing.Plugin.LoadStandardValues(System.String)
Sets the values from the specified file to this plug-in.
Filename: The short name of the file containing the attributes.
Returns: True on success. Otherwise, false.

Tekla.Structures.Drawing.Plugin.TrySetAttribute(System.String,System.Int32)
Sets the specified attribute of the plug-in to the given value.
NOTE! Only works on already inserted plug-ins.
FieldName: The name of the attribute to set.
fieldValue: The value for the attribute.
Returns: True on success. Otherwise, false.

Tekla.Structures.Drawing.Plugin.TrySetAttribute(System.String,System.String)
Sets the specified attribute of the plug-in to the given value.
NOTE! Only works on already inserted plug-ins.
FieldName: The name of the attribute to set.
fieldValue: The value for the attribute.
Returns: True on success. Otherwise, false.

Tekla.Structures.Drawing.Plugin.TrySetAttribute(System.String,System.Double)
Sets the specified attribute of the plug-in to the given value.
NOTE! Only works on already inserted plug-ins.
FieldName: The name of the attribute to set.
fieldValue: The value for the attribute.
Returns: True on success. Otherwise, false.

Tekla.Structures.Drawing.Plugin.SetAttribute(System.String,System.Int32)
Sets the specified attribute of the plug-in to the given value.
NOTE! Only works on already inserted plug-ins.
FieldName: The name of the attribute to set.
fieldValue: The value for the attribute.
Throws Tekla.Structures.Drawing.CannotSetAttributeForPluginException:
Thrown when setting the attribute to the plug-in failed for an unknown reason
(might indicate an invalid plug-in name).
Throws Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToIncorrectTypeException:
Thrown when setting a value with an invalid type for the specified field.
Throws Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToInexistantFieldException:
Thrown when setting the value of an inexistent field.

Tekla.Structures.Drawing.Plugin.SetAttribute(System.String,System.Double)
Sets the specified attribute of the plug-in to the given value.
NOTE! Only works on already inserted plug-ins.
FieldName: The name of the attribute to set.
fieldValue: The value for the attribute.
Throws Tekla.Structures.Drawing.CannotSetAttributeForPluginException:
Thrown when setting the attribute to the plug-in failed for an unknown reason
(might indicate an invalid plug-in name).
Throws Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToIncorrectTypeException:
Thrown when setting a value with an invalid type for the specified field.
Throws Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToInexistantFieldException:
Thrown when setting the value of an inexistent field.

Tekla.Structures.Drawing.Plugin.SetAttribute(System.String,System.String)
Sets the specified attribute of the plug-in to the given value.
NOTE! Only works on already inserted plug-ins.
FieldName: The name of the attribute to set.
fieldValue: The value for the attribute.
Throws Tekla.Structures.Drawing.CannotSetAttributeForPluginException:
Thrown when setting the attribute to the plug-in failed for an unknown reason
(might indicate an invalid plug-in name).
Throws Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToIncorrectTypeException:
Thrown when setting a value with an invalid type for the specified field.
Throws Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToInexistantFieldException:
Thrown when setting the value of an inexistent field.

Tekla.Structures.Drawing.Plugin.TryGetAttribute(System.String,System.Int32@)
Gets the value of the specified int attribute of the plug-in.
FieldName: The name of the attribute to get.
FieldValue: The value of the attribute.
Returns: True on success.

Tekla.Structures.Drawing.Plugin.GetIntAttribute(System.String)
Gets the value of the specified int attribute of the plug-in.
FieldName: The name of the attribute to get.
Throws Tekla.Structures.Drawing.CannotGetAttributeForPluginException:
Thrown when the getting of the attribute failed for an unknown reason
(might indicate an invalid plug-in name).
Throws Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToIncorrectTypeException:
Thrown when getting a value with an invalid type for the specified field.
Throws Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToInexistantFieldException:
Thrown when getting the value of an inexistent field.
Returns: The value of the attribute, or 0 if the plug-in does not have such an attribute.

Tekla.Structures.Drawing.Plugin.TryGetAttribute(System.String,System.Double@)
Gets the value of the specified double attribute of the plug-in.
FieldName: The name of the attribute to get.
FieldValue: The value of the attribute.
Returns: True on success.

Tekla.Structures.Drawing.Plugin.GetDoubleAttribute(System.String)
Gets the value of the specified double attribute of the plug-in.
FieldName: The name of the attribute to get.
Throws Tekla.Structures.Drawing.CannotGetAttributeForPluginException:
Thrown when the getting of the attribute failed for an unknown reason
(might indicate an invalid plug-in name).
Throws Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToIncorrectTypeException:
Thrown when getting a value with an invalid type for the specified field.
Throws Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToInexistantFieldException:
Thrown when getting the value of an inexistent field.
Returns: The value of the attribute, or 0 if the plug-in does not have such an attribute.

Tekla.Structures.Drawing.Plugin.TryGetAttribute(System.String,System.String@)
Gets the value of the specified string attribute of the plug-in.
FieldName: The name of the attribute to get.
FieldValue: The value of the attribute.
Returns: True on success.

Tekla.Structures.Drawing.Plugin.GetStringAttribute(System.String)
Gets the value of the specified string attribute of the plug-in.
FieldName: The name of the attribute to get.
Throws Tekla.Structures.Drawing.CannotGetAttributeForPluginException:
Thrown when the getting of the attribute failed for an unknown reason
(might indicate an invalid plug-in name).
Throws Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToIncorrectTypeException:
Thrown when getting a value with an invalid type for the specified field.
Throws Tekla.Structures.Drawing.CannotGetAttributeForPluginDueToInexistantFieldException:
Thrown when getting the value of an inexistent field.
Returns: The value of the attribute, or an empty string if the plug-in does not have such an attribute.